Repository: creeeasy/hotel-booking-app
Catalog: source-code/lib/l10n/arb/app_*.arb
Languages: ar

# loginTitle
source: Login
ar: تسجيل الدخول

# welcomeBackSimple
source: Welcome Back
ar: أهلاً بعودتك

# welcomeBack
source: Welcome Back, {hotelName}!
ar: أهلاً بعودتك، {hotelName}!

# signInToAccount
source: Sign in to access your account
ar: سجل الدخول للوصول إلى حسابك

source: Email Address
ar: عنوان البريد الإلكتروني

# emailValidationError
source: Please enter your email
ar: الرجاء إدخال بريدك الإلكتروني

source: Password
ar: كلمة المرور

# passwordValidationError
source: Please enter your password
ar: الرجاء إدخال كلمة المرور

source: Forgot Password?
ar: هل نسيت كلمة المرور؟

source: Sign In
ar: تسجيل الدخول

# orDivider
source: OR
ar: أو

# noAccountPrompt
source: Don't have an account?
ar: ليس لديك حساب؟

source: Register
ar: تسجيل

source: User not found
ar: المستخدم غير موجود

source: Invalid email
ar: بريد إلكتروني غير صالح

source: Missing password
ar: كلمة المرور مفقودة

source: Wrong credentials
ar: بيانات اعتماد خاطئة

# authError
source: Authentication error
ar: خطأ في المصادقة

source: Bookings
ar: الحجوزات

source: No hotels found
ar: لم يتم العثور على فنادق

# roomCapacity
source: {count, plural, one {# guest} other {# guests}}
ar: {count, plural, one {# ضيف} other {# ضيوف}}

source: Completed
ar: مكتمل

source: Try Again
ar: حاول مرة أخرى

# filterRating
source: Rating
ar: التقييم

# filterPrice
source: Price
ar: السعر

# filterMinPeople
source: Guests
ar: الضيوف

# filterLocation
source: Location
ar: الموقع

# logoutTitle
source: Log out
ar: تسجيل الخروج

# logoutContent
source: Are you sure you want to log out?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟

source: Cancel
ar: إلغاء

source: Log Out
ar: تسجيل الخروج

source: Just now
ar: الآن

# minutesAgo
source: {minutes} minutes ago
ar: منذ {minutes} دقيقة

# hoursAgo
source: {hours} hours ago
ar: منذ {hours} ساعة

# daysAgo
source: {days} days ago
ar: منذ {days} يوم

# amenityWifi
source: WiFi
ar: واي فاي

# amenityPool
source: Pool
ar: مسبح

# amenityGym
source: Gym
ar: صالة رياضية

# amenityRestaurant
source: Restaurant
ar: مطعم

# amenitySpa
source: Spa
ar: منتجع صحي

# amenityParking
source: Parking
ar: موقف سيارات

# amenityRoomService
source: Room Service
ar: خدمة الغرف

# amenityPlayground
source: Kids Playground
ar: ملعب للأطفال

# amenityBar
source: Bar
ar: بار

# amenityConcierge
source: Concierge
ar: خدمة الكونسيرج

# amenityBusinessCenter
source: Business Center
ar: مركز أعمال

# amenityLaundry
source: Laundry
ar: غسيل الملابس

# amenityAirportShuttle
source: Airport Shuttle
ar: خدمة نقل المطار

# amenityPetFriendly
source: Pet Friendly
ar: صديق للحيوانات الأليفة

# amenityAccessible
source: Accessible
ar: يمكن الوصول إليه

# amenitySmokeFree
source: Smoke Free
ar: ممنوع التدخين

# amenityBeachAccess
source: Beach Access
ar: الوصول إلى الشاطئ

# amenityTv
source: TV
ar: تلفزيون

# amenityAc
source: Air Conditioning
ar: تكييف

# amenityHeating
source: Heating
ar: تدفئة

# amenitySafe
source: Safe
ar: خزنة

# amenityKitchen
source: Kitchen
ar: مطبخ

# amenityMinibar
source: Minibar
ar: ميني بار

# amenityBathtub
source: Bathtub
ar: حوض استحمام

# amenityToiletries
source: Toiletries
ar: أدوات استحمام

# noHotelsTitle
source: No Hotels Found
ar: لم يتم العثور على فنادق

# noHotelsDefaultMessage
source: We couldn't find any hotels matching your criteria. Try adjusting your search filters or exploring nearby locations.
ar: لم نتمكن من العثور على أي فنادق تطابق معاييرك. حاول تعديل عوامل تصفية البحث أو استكشاف المواقع القريبة.

# bookingsTitle
source: Bookings
ar: الحجوزات

# bookingsNavTitle
source: Bookings
ar: الحجوزات

# filterBookingsTitle
source: Filter Bookings
ar: تصفية الحجوزات

# bookingDetailsTitle
source: Booking Details
ar: تفاصيل الحجز

source: Room Information
ar: معلومات الغرفة

source: Guest Information
ar: معلومات الضيف

source: Booking Dates
ar: تواريخ الحجز

source: Payment Information
ar: معلومات الدفع

source: Total Amount
ar: المبلغ الإجمالي

source: Payment Status
ar: حالة الدفع

source: Paid
ar: مدفوع

# markCompleted
source: Mark as Completed
ar: وضع علامة كمكتمل

source: Check-in
ar: تاريخ الوصول

source: Check-out
ar: تاريخ المغادرة

# perNight
source: {price} per night
ar: {price} لليلة الواحدة

source: No Bookings Found
ar: لا توجد حجوزات

# noBookingsDefault
source: You don't have any bookings yet
ar: ليس لديك أي حجوزات حتى الآن

# noFilteredBookings
source: No {status} bookings found
ar: لم يتم العثور على حجوزات {status}

source: Failed to load bookings
ar: فشل تحميل الحجوزات

source: Retry
ar: إعادة المحاولة

# summaryTotal
source: Total
ar: الإجمالي

# summaryPending
source: Pending
ar: قيد الانتظار

# summaryCompleted
source: Completed
ar: مكتمل

# summaryRevenue
source: Revenue
ar: الإيرادات

source: Complete
ar: إكمال

# nights
source: {count, plural, =1{night} other{nights}}
ar: {count, plural, =1{ليلة} other{ليالي}}

# dashboardSubtitle
source: Here's what's happening today
ar: إليك ما يحدث اليوم

source: Active Bookings
ar: الحجوزات النشطة

source: Rooms Available
ar: الغرف المتاحة

source: Total Reviews
ar: إجمالي التقييمات

source: Pending Bookings
ar: الحجوزات قيد الانتظار

source: Quick Access
ar: الوصول السريع

source: Recent Activity
ar: النشاط الأخير

source: No recent activity
ar: لا يوجد نشاط أخير

# roomsTitle
source: Rooms
ar: الغرف

# roomsDescription
source: Manage room details
ar: إدارة تفاصيل الغرف

# bookingsDescription
source: View all bookings
ar: عرض جميع الحجوزات

# reviewsTitle
source: Reviews
ar: التقييمات

# reviewsDescription
source: Check guest feedback
ar: تحقق من ملاحظات الضيوف

# profileTitle
source: Profile
ar: الملف الشخصي

# profileDescription
source: Hotel profile
ar: الملف الشخصي للفندق

# validUrl
source: Type a valid url!
ar: اكتب عنوان URL صالحًا!

# emptyInput
source: Input can't be empty!
ar: لا يمكن أن يكون الإدخال فارغًا!

source: Update Location
ar: تحديث الموقع

source: Update Description
ar: تحديث الوصف

source: Update Map Link
ar: تحديث رابط الخريطة

# updateContactInfo
source: Update Contact Information
ar: تحديث معلومات الاتصال

# completeHotelProfile
source: Complete Your Hotel Profile
ar: أكمل ملف تعريف فندقك

# selectWilaya
source: Select a Wilaya
ar: اختر ولاية

source: Back
ar: رجوع

source: Finish
ar: إنهاء

source: Next
ar: التالي

# loadingPlaceholder
source: Loading
ar: جاري التحميل

# inputEmpty
source: Input can't be empty!
ar: لا يمكن أن يكون الإدخال فارغًا!

source: Update Contact Information
ar: تحديث معلومات الاتصال

source: Enter {field}...
ar: أدخل {field}...

source: Profile
ar: الملف الشخصي

source: Settings
ar: الإعدادات

source: Log Out
ar: تسجيل الخروج

source: Hotel Photos
ar: صور الفندق

source: No photos added
ar: لم تتم إضافة صور

source: Add Photo
ar: إضافة صورة

source: Basic Information
ar: المعلومات الأساسية

source: Hotel Name
ar: اسم الفندق

source: Required
ar: مطلوب

source: Description
ar: الوصف

source: Contact Information
ar: معلومات الاتصال

source: Phone Number
ar: رقم الهاتف

source: Location
ar: الموقع

source: Wilaya
ar: الولاية

source: Map Link
ar: رابط الخريطة

# profileUpdatedSuccessfully
source: Your profile data has been updated successfully.
ar: تم تحديث بيانات ملفك الشخصي بنجاح.

source: Error updating profile
ar: خطأ في تحديث الملف الشخصي

source: Image uploaded successfully
ar: تم تحميل الصورة بنجاح

# errorUploadingImage
source: Error uploading image: {error}
ar: خطأ في تحميل الصورة: {error}

source: Image removed successfully
ar: تمت إزالة الصورة بنجاح

# errorRemovingImage
source: Error removing image: {error}
ar: خطأ في إزالة الصورة: {error}

source: Guest Reviews
ar: تقييمات الضيوف

source: All
ar: الكل

# stars
source: {count} Stars
ar: {count} نجوم

# reviewsCount
source: {count} Reviews
ar: {count} تقييمات

source: Error loading reviews
ar: خطأ في تحميل التقييمات

source: Home
ar: الرئيسية

source: rooms
ar: غرف

source: reviews
ar: تقييمات

source: Hotel Registration
ar: تسجيل الفندق

# registerHotel
source: Register Your Hotel
ar: سجل فندقك

source: Email
ar: البريد الإلكتروني

source: Confirm Password
ar: تأكيد كلمة المرور

# registerHotelButton
source: Register Hotel
ar: تسجيل الفندق

# enterHotelName
source: Please enter your hotel's name.
ar: الرجاء إدخال اسم فندقك.

# validEmail
source: Please enter a valid email address.
ar: الرجاء إدخال عنوان بريد إلكتروني صالح.

# passwordLength
source: Password must be at least 6 characters long.
ar: يجب أن تكون كلمة المرور 6 أحرف على الأقل.

# passwordMatch
source: Passwords do not match.
ar: كلمات المرور غير متطابقة.

# weakPassword
source: The password provided is too weak.
ar: كلمة المرور المقدمة ضعيفة جدًا.

# emailInUse
source: Email is already in use
ar: البريد الإلكتروني قيد الاستخدام بالفعل

# registerFailed
source: Failed to register
ar: فشل التسجيل

source: Create Account
ar: إنشاء حساب

source: Join Fatiel
ar: انضم إلى فتيل

source: First Name
ar: الاسم الأول

source: Last Name
ar: اسم العائلة

# createAccountButton
source: Create Account
ar: إنشاء حساب

# firstNameLastNameRequired
source: Please enter your first and last name.
ar: الرجاء إدخال اسمك الأول واسم عائلتك.

source: Confirm Booking
ar: تأكيد الحجز

source: Check-in Date
ar: تاريخ تسجيل الوصول

source: Check-out Date
ar: تاريخ تسجيل المغادرة

source: Total Nights
ar: إجمالي الليالي

source: Total Price
ar: السعر الإجمالي

# confirmAndPay
source: Confirm & Pay
ar: تأكيد والدفع

source: Select Check-in Date
ar: حدد تاريخ تسجيل الوصول

source: Select Check-out Date
ar: حدد تاريخ تسجيل المغادرة

source: Confirm
ar: تأكيد

# bookingConfirmed
source: Booking confirmed successfully!
ar: تم تأكيد الحجز بنجاح!

source: From
ar: من

source: night
ar: ليلة

source: Book Now
ar: احجز الآن

source: Unavailable
ar: غير متاح

source: Oops! Something went wrong
ar: عفوًا! حدث خطأ ما

source: Go to Home
ar: الذهاب إلى الرئيسية

source: Remove from Favorites
ar: إزالة من المفضلة

# removeHotelFromFavoritesConfirmation
source: Are you sure you want to remove this hotel from your favorites?
ar: هل أنت متأكد من أنك تريد إزالة هذا الفندق من مفضلاتك؟

source: Remove
ar: إزالة

source: Added to favorites
ar: تمت الإضافة إلى المفضلة

source: Removed from favorites
ar: تمت الإزالة من المفضلة

source: Failed to update favorites
ar: فشل تحديث المفضلة

# removeFromFavoritesSemantic
source: Remove from favorites
ar: إزالة من المفضلة

# addToFavoritesSemantic
source: Add to favorites
ar: إضافة إلى المفضلة

source: Image not available
ar: الصورة غير متوفرة

source: Location not specified
ar: الموقع غير محدد

source: No image available
ar: لا توجد صورة متاحة

source: hotel
ar: فندق

source: hotels
ar: فنادق

# tryAdjustingSearchFilters
source: Try adjusting your search filters
ar: حاول تعديل عوامل تصفية البحث

source: No Data Found
ar: لم يتم العثور على بيانات

# noPopularDestinationsAvailable
source: No popular destinations available at the moment.
ar: لا توجد وجهات شهيرة متاحة في الوقت الحالي.

source: Error
ar: خطأ

source: Guests
ar: ضيوف

source: Available
ar: متاح

source: See All
ar: عرض الكل

source: All Wilayas
ar: جميع الولايات

source: Failed to load wilaya data
ar: فشل تحميل بيانات الولاية

# noHotelsListedInAnyWilaya
source: No hotels currently listed in any wilaya
ar: لا توجد فنادق مدرجة حاليًا في أي ولاية

# discoveringAmazingPlaces
source: Discovering amazing places for you
ar: اكتشاف أماكن رائعة لك

source: Booking Summary
ar: ملخص الحجز

source: Price Summary
ar: ملخص السعر

source: Room Rate
ar: سعر الغرفة

source: Duration
ar: المدة

source: Room Details
ar: تفاصيل الغرفة

source: Capacity
ar: السعة

source: Explore Hotel
ar: استكشاف الفندق

source: Booking Error
ar: خطأ في الحجز

source: Go Back
ar: العودة

source: No Booking Found
ar: لم يتم العثور على حجز

# noBookingDetails
source: We couldn't find any booking details
ar: لم نتمكن من العثور على أي تفاصيل حجز

source: My Bookings
ar: حجوزاتي

source: Failed to load booking details
ar: فشل تحميل تفاصيل الحجز

source: Booking details not available
ar: تفاصيل الحجز غير متوفرة

source: Unknown location
ar: موقع غير معروف

source: Cancelled
ar: ملغى

source: View Details
ar: عرض التفاصيل

source: Write a Review
ar: اكتب تقييمًا

source: Edit Review
ar: تعديل التقييم

source: Share your experience...
ar: شارك تجربتك...

source: Please write a comment
ar: الرجاء كتابة تعليق

source: Submit
ar: إرسال

source: Update
ar: تحديث

source: Delete Review
ar: حذف التقييم

# areYouSureDeleteReview
source: Are you sure you want to delete this review?
ar: هل أنت متأكد من أنك تريد حذف هذا التقييم؟

source: Delete
ar: حذف

source: Cancel Booking
ar: إلغاء الحجز

# areYouSureCancelBooking
source: Are you sure you want to cancel this booking?
ar: هل أنت متأكد من أنك تريد إلغاء هذا الحجز؟

source: No
ar: لا

source: Yes, Cancel
ar: نعم، إلغاء

source: Explore Hotels
ar: استكشاف الفنادق

source: No Pending Bookings!
ar: لا توجد حجوزات قيد الانتظار!

source: No Completed Bookings!
ar: لا توجد حجوزات مكتملة!

source: No Cancelled Bookings!
ar: لا توجد حجوزات ملغاة!

# startYourJourney
source: Start your journey today! Find the best hotels and book your dream stay effortlessly.
ar: ابدأ رحلتك اليوم! ابحث عن أفضل الفنادق واحجز إقامتك التي تحلم بها بسهولة.

# completedBookingsAppearHere
source: Your completed bookings will appear here. Share your experience by leaving reviews!
ar: ستظهر حجوزاتك المكتملة هنا. شارك تجربتك بترك التقييمات!

# cancelledBookingsAppearHere
source: Your cancelled bookings will appear here. You can always book again!
ar: ستظهر حجوزاتك الملغاة هنا. يمكنك دائمًا الحجز مرة أخرى!

source: Pending
ar: قيد الانتظار

source: Amenities
ar: وسائل الراحة

source: Recommended
ar: مُوصى به

source: Near Me
ar: بالقرب مني

source: Recommended Hotels
ar: الفنادق الموصى بها

source: Hotels Near You
ar: الفنادق القريبة منك

source: Success
ar: نجاح

source: Failed to load hotels
ar: فشل تحميل الفنادق

source: No Hotels Available
ar: لا توجد فنادق متاحة

# noHotelsMatchingCriteria
source: We couldn't find any hotels matching your criteria.
ar: لم نتمكن من العثور على أي فنادق تطابق معاييرك.

source: Find hotels in cities
ar: ابحث عن فنادق في المدن

source: Failed to load city data
ar: فشل تحميل بيانات المدينة

# noHotelsListedInCities
source: No hotels are currently listed in these cities.
ar: لا توجد فنادق مدرجة حاليًا في هذه المدن.

source: Loading your favorites
ar: جارٍ تحميل مفضلاتك

source: Couldn't load favorites
ar: تعذر تحميل المفضلة

# checkConnectionAndTryAgain
source: Please check your connection and try again
ar: يرجى التحقق من اتصالك والمحاولة مرة أخرى

source: No Favorites Yet
ar: لا توجد مفضلات حتى الآن

# saveFavoritesMessage
source: Save your favorite hotels by tapping the heart icon when browsing
ar: احفظ فنادقك المفضلة بالنقر على أيقونة القلب عند التصفح

source: Browse Hotels
ar: تصفح الفنادق

source: Recommended Hotels ({count})
ar: الفنادق الموصى بها ({count})

source: Hotels Near You ({count})
ar: الفنادق القريبة منك ({count})

# weCouldntFindAnyHotels
source: We couldn't find any hotels matching your criteria.
ar: لم نتمكن من العثور على أي فنادق تطابق معاييرك.

source: No reviews data available
ar: لا توجد بيانات تقييمات متاحة

source: Guest Favorite
ar: المفضلة لدى الضيوف

# basedOnReviews
source: Based on {totalRatings} reviews
ar: بناءً على {totalRatings} تقييمات

# starsCount
source: {ratingCount} Stars
ar: {ratingCount} نجوم

source: Explore room offers
ar: استكشف عروض الغرف

# perNightSimple
source: Per night
ar: لليلة الواحدة

source: Room Type
ar: نوع الغرفة

source: Dates
ar: التواريخ

source: Successfully booked
ar: تم الحجز بنجاح

source: No amenities listed
ar: لا توجد وسائل راحة مدرجة

source: Available from
ar: متاح من

source: Not currently available
ar: غير متاح حاليًا

source: Failed to load rooms
ar: فشل تحميل الغرف

source: No rooms available
ar: لا توجد غرف متاحة

source: Search Hotels
ar: البحث عن فنادق

source: Search hotels, locations...
ar: البحث عن فنادق، مواقع...

source: Search for hotels
ar: البحث عن فنادق

# enterHotelNameLocation
source: Enter hotel name, location or amenities to find your perfect stay
ar: أدخل اسم الفندق أو الموقع أو وسائل الراحة للعثور على إقامتك المثالية

source: Search failed
ar: فشل البحث

source: Input can't be empty!
ar: لا يمكن أن يكون الإدخال فارغًا!

source: An error occurred
ar: حدث خطأ

source: Update first name
ar: تحديث الاسم الأول

source: Update last name
ar: تحديث اسم العائلة

source: Select location
ar: اختر الموقع

source: Update Your Information
ar: تحديث معلوماتك

source: Select a Wilaya
ar: اختر ولاية

source: Enter
ar: أدخل

# passwordUpdatedSuccessfully
source: Your password has been updated successfully
ar: تم تحديث كلمة المرور الخاصة بك بنجاح

source: Update Password
ar: تحديث كلمة المرور

source: Current Password
ar: كلمة المرور الحالية

# pleaseEnterCurrentPassword
source: Please enter your current password
ar: الرجاء إدخال كلمة المرور الحالية

source: New Password
ar: كلمة المرور الجديدة

# pleaseEnterNewPassword
source: Please enter a new password
ar: الرجاء إدخال كلمة مرور جديدة

source: Password must be at least 6 characters
ar: يجب أن تكون كلمة المرور 6 أحرف على الأقل

source: Passwords do not match
ar: كلمات المرور غير متطابقة

# wrongPassword
source: Your current password is incorrect.
ar: كلمة المرور الحالية غير صحيحة.

# requiresRecentLogin
source: Please reauthenticate to update your password.
ar: يرجى إعادة المصادقة لتحديث كلمة المرور الخاصة بك.

# genericError
source: An unexpected error occurred. Please try again.
ar: حدث خطأ غير متوقع. يرجى المحاولة مرة أخرى.

# failedToUpdatePassword
source: Failed to update password. Please try again.
ar: فشل تحديث كلمة المرور. يرجى المحاولة مرة أخرى.

source: Password Mismatch
ar: عدم تطابق كلمة المرور

source: Explore
ar: استكشاف

source: Favorites
ar: المفضلة

source: Profile Settings
ar: إعدادات الملف الشخصي

source: Image upload failed
ar: فشل تحميل الصورة

source: Profile image updated successfully
ar: تم تحديث صورة الملف الشخصي بنجاح

source: Failed to upload image
ar: فشل تحميل الصورة

source: Remove Profile Image
ar: إزالة صورة الملف الشخصي

# removeProfileImageConfirmation
source: Are you sure you want to remove your profile image?
ar: هل أنت متأكد من أنك تريد إزالة صورة ملفك الشخصي؟

source: Profile image removed
ar: تمت إزالة صورة الملف الشخصي

source: Failed to remove image
ar: فشل إزالة الصورة

source: OK
ar: موافق

source: Uploading...
ar: جاري التحميل...

source: Remove Photo
ar: إزالة الصورة

source: Account Settings
ar: إعدادات الحساب

source: Update Profile
ar: تحديث الملف الشخصي

source: Change Password
ar: تغيير كلمة المرور

source: Wilaya not found
ar: لم يتم العثور على الولاية

source: Wilaya data not available
ar: بيانات الولاية غير متوفرة

source: Failed to load image
ar: فشل تحميل الصورة

# noHotelsRegistered
source: There are currently no hotels registered in {wilayaName}
ar: لا توجد فنادق مسجلة حاليًا في {wilayaName}

source: Please wait a moment
ar: الرجاء الانتظار لحظة

source: Press back again to exit
ar: اضغط على رجوع مرة أخرى للخروج

source: Password reset
ar: إعادة تعيين كلمة المرور

# passwordResetSentMessage
source: We have now sent you a password reset link.
ar: لقد أرسلنا لك الآن رابط إعادة تعيين كلمة المرور.

# forgotPasswordGenericError
source: We could not process your request. Please make sure that you are a registered user, or if not, register a user now by going back one step.
ar: لم نتمكن من معالجة طلبك. يرجى التأكد من أنك مستخدم مسجل، أو إذا لم تكن كذلك، فقم بتسجيل مستخدم الآن بالرجوع خطوة واحدة.

source: Reset Password
ar: إعادة تعيين كلمة المرور

# forgotPasswordInstructions
source: Enter your registered email address to receive a password reset link
ar: أدخل عنوان بريدك الإلكتروني المسجل لتلقي رابط إعادة تعيين كلمة المرور

# enterYourEmail
source: Please enter your email
ar: الرجاء إدخال بريدك الإلكتروني

# enterValidEmail
source: Please enter a valid email
ar: الرجاء إدخال بريد إلكتروني صالح

source: Send Reset Link
ar: إرسال رابط إعادة التعيين

source: Back to Login
ar: العودة إلى تسجيل الدخول

source: Failed to load hotel details
ar: فشل تحميل تفاصيل الفندق

source: No hotel information available
ar: لا تتوفر معلومات الفندق

source: Room
ar: الغرفة

source: No description available
ar: لا يوجد وصف متاح

source: No contact information available
ar: لا تتوفر معلومات الاتصال

# ratingsAndReviews
source: Ratings & Reviews
ar: التقييمات والمراجعات

source: View all
ar: عرض الكل

source: No reviews yet
ar: لا توجد تقييمات حتى الآن

source: Average Rating
ar: متوسط التقييم

source: Location on Map
ar: الموقع على الخريطة

source: Open in Maps
ar: افتح في الخرائط

source: Map location not available
ar: موقع الخريطة غير متوفر

source: Room Offers
ar: عروض الغرف

source: View Room Offers
ar: عرض عروض الغرف

# selectAccountType
source: Select your account type to begin
ar: حدد نوع حسابك للبدء

source: Traveler
ar: مسافر

# travelerSubtitle
source: Discover and book luxury stays worldwide
ar: اكتشف واحجز إقامات فاخرة في جميع أنحاء العالم

source: Hotel Partner
ar: شريك الفندق

# hotelPartnerSubtitle
source: List and manage your luxury properties
ar: قائمة وإدارة العقارات الفاخرة الخاصة بك

# alreadyHaveAccount
source: Already have an account?
ar: هل لديك حساب بالفعل؟

source: Hotel information not available
ar: معلومات الفندق غير متوفرة

source: room available
ar: غرفة متاحة

source: PREMIUM
ar: ممتاز

source: per page
ar: لكل صفحة

source: Failed to load reviewer details
ar: فشل تحميل تفاصيل المراجع

source: Reviewed by
ar: تمت المراجعة بواسطة

source: No comment provided
ar: لم يتم تقديم تعليق

source: Add Room
ar: إضافة غرفة

source: Room marked as unavailable
ar: تم وضع علامة على الغرفة كغير متاحة

source: Room marked as available
ar: تم وضع علامة على الغرفة كمتاحة

# failedToUpdateRoom
source: Failed to update room: {error}
ar: فشل تحديث الغرفة: {error}

source: Delete Room
ar: حذف الغرفة

# deleteRoomConfirmation
source: This action cannot be undone. Are you sure?
ar: لا يمكن التراجع عن هذا الإجراء. هل أنت متأكد؟

source: Room deleted successfully
ar: تم حذف الغرفة بنجاح

# failedToDeleteRoom
source: Failed to delete room: {error}
ar: فشل حذف الغرفة: {error}

source: Edit Room
ar: تعديل الغرفة

source: Add New Room
ar: إضافة غرفة جديدة

source: Room Name
ar: اسم الغرفة

source: Price per night
ar: السعر لكل ليلة

source: Available for booking
ar: متاح للحجز

source: Room Photos
ar: صور الغرفة

source: Update Room
ar: تحديث الغرفة

source: Room updated successfully
ar: تم تحديث الغرفة بنجاح

source: Room added successfully
ar: تمت إضافة الغرفة بنجاح

# failedToAddRoom
source: Failed to add room: {error}
ar: فشل إضافة الغرفة: {error}

# failedToUpdateRoomGeneric
source: Failed to update room: {error}
ar: فشل تحديث الغرفة: {error}

# guest
source: {count, plural, =1{guest} other{guests}}
ar: {count, plural, =1{ضيف} other{ضيوف}}

# photoCount
source: {count, plural, =1{photo} other{photos}}
ar: {count, plural, =1{صورة} other{صور}}

source: Edit
ar: تعديل

source: Mark Unavailable
ar: وضع علامة كغير متاح

source: Mark Available
ar: وضع علامة كمتاح

source: Pricing & Availability
ar: التسعير والتوافر

source: Change Language
ar: تغيير اللغة

source: Select Language
ar: اختر اللغة

# resetFiltersTitle
source: Reset Filters
ar: إعادة تعيين الفلاتر

# resetFiltersContent
source: Are you sure you want to reset all filters?
ar: هل أنت متأكد من أنك تريد إعادة تعيين جميع الفلاتر؟

# resetFiltersCancel
source: Cancel
ar: إلغاء

# resetFiltersConfirm
source: Reset
ar: إعادة تعيين

source: Apply Filters
ar: تطبيق الفلاتر

# filterByMinGuests
source: Minimum Guests
ar: الحد الأدنى للضيوف

# filterByPriceRange
source: Price Range
ar: نطاق السعر

# filterByCustomerRating
source: Customer Rating
ar: تقييم العملاء

# filterByLocation
source: Location (Wilaya)
ar: الموقع (ولاية)

source: All Hotels
ar: جميع الفنادق

# favoritesTitle
source: Favorites
ar: المفضلة

source: Select dates first
ar: اختر التواريخ أولًا

source: Refresh
ar: تحديث

source: No items to display
ar: لا توجد عناصر لعرضها

source: No data available
ar: لا توجد بيانات متاحة
