Repository: creeeasy/hotel-booking-app
Catalog: source-code/lib/l10n/arb/app_*.arb
Languages: ar

# noHotelsDescription
source: We couldn't find any hotels matching your criteria
ar: لم نتمكن من العثور على أي فنادق تطابق معاييرك

source: Reset
ar: إعادة الضبط

source: Hello
ar: مرحباً

source: Find Your Perfect Stay
ar: ابحث عن إقامتك المثالية

# discoverAmazingHotels
source: Discover amazing hotels tailored just for you
ar: اكتشف فنادق مذهلة مصممة خصيصًا لك

source: Explore All
ar: استكشف الكل

source: Popular Destinations
ar: الوجهات الشعبية

source: Starting from
ar: تبدأ من

# tryAdjustingFilters
source: Try adjusting your filters or search criteria
ar: حاول تعديل عوامل التصفية أو تحقق لاحقًا

source: Reset Filters
ar: إعادة تعيين الفلاتر

# currencySymbol
source: DZD
ar: د.ج

source: Luxury
ar: فاخر

source: Hotels Found
ar: الفنادق الموجودة

source: Facilities
ar: مرافق

source: Availability
ar: التوفر

# activityNewBooking
source: New Booking
ar: حجز جديد

# activityBookingDescription
source: {firstName} {lastName} booked {roomName}
ar: قام {firstName} {lastName} بحجز {roomName}

# activityNewReview
source: New Review
ar: مراجعة جديدة

# activityReviewDescription
source: {firstName} {lastName} left a {rating}-star review
ar: ترك {firstName} {lastName} مراجعة بتقييم {rating} نجوم

source: Hotels in {wilaya}
ar: فنادق في {wilaya}

source: Currently Available
ar: متاح حالياً

source: Available Soon
ar: سيكون متاحاً قريباً
